name: "VST_Net"

layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "test11.txt"
    batch_size: 11
  }
  include: { phase: TEST }
}

layer {
  name: "slice"
  type: "Slice"
  bottom: "data"
  top: "output1"
  top: "output2"
  slice_param {
    axis: 1
    slice_point: 1
  }
}


layer {
  name: "conv1"
  type: "Convolution"
  bottom: "output1"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 0.1
  }
  convolution_param {
    num_output:64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}






layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 0.1
  }
  convolution_param {
    num_output: 32
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "output2"
  top: "conv1_1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 0.1
  }
  convolution_param {
    num_output: 32
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
	name: "sum1"
	type: "Eltwise"
	bottom: "conv1_1"
	bottom: "conv2"
	top: "sum1"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "sum1"
  top: "conv3"
  param {
    name: "conv_1_w"
    lr_mult: 1.0
  }
  param {
    name: "conv_1_b"
    lr_mult: 1.0
  } 
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
  relu_param {
    negative_slope: 0.0
  }
}

layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    name: "conv_2_w"
    lr_mult: 1.0
  }
  param {
    name: "conv_2_b"
    lr_mult: 1.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bn2"
  type: "BatchNorm"
  bottom: "conv4"
  top: "conv4"
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}

layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
  relu_param {
    negative_slope: 0.0
  }
}

layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    name: "conv_3_w"
    lr_mult: 1.0
  }
  param {
    name: "conv_3_b"
    lr_mult: 1.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bn3"
  type: "BatchNorm"
  bottom: "conv5"
  top: "conv5"
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}

layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
  relu_param {
    negative_slope: 0.0
  }
}

layer {
  name: "conv6"
  type: "Convolution"
  bottom: "conv5"
  top: "conv6"
  param {
    name: "conv_4_w"
    lr_mult: 1.0
  }
  param {
    name: "conv_4_b"
    lr_mult: 1.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bn4"
  type: "BatchNorm"
  bottom: "conv6"
  top: "conv6"
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}

layer {
  name: "relu6"
  type: "ReLU"
  bottom: "conv6"
  top: "conv6"
  relu_param {
    negative_slope: 0.0
  }
}

layer {
  name: "conv7"
  type: "Convolution"
  bottom: "conv6"
  top: "conv7"
  param {
    name: "conv_5_w"
    lr_mult: 1.0
  }
  param {
    name: "conv_5_b"
    lr_mult: 1.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bn5"
  type: "BatchNorm"
  bottom: "conv7"
  top: "conv7"
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}

layer {
  name: "relu7"
  type: "ReLU"
  bottom: "conv7"
  top: "conv7"
  relu_param {
    negative_slope: 0.0
  }
}

layer {
  name: "conv8"
  type: "Convolution"
  bottom: "conv7"
  top: "conv8"
  param {
    name: "conv_6_w"
    lr_mult: 1.0
  }
  param {
    name: "conv_6_b"
    lr_mult: 1.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bn6"
  type: "BatchNorm"
  bottom: "conv8"
  top: "conv8"
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  param {
    lr_mult: 1.00
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}

layer {
  name: "relu8"
  type: "ReLU"
  bottom: "conv8"
  top: "conv8"
  relu_param {
    negative_slope: 0.0
  }
}


layer {
  name: "conv9"
  type: "Convolution"
  bottom: "conv8"
  top: "conv9"
  param {
 
    lr_mult: 1.0
  }
  param {

    lr_mult: 1.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}



layer {
	name: "sum2"
	type: "Eltwise"
	bottom: "sum1"
	bottom: "conv9"
	top: "sum2"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "conv10"
  type: "Convolution"
  bottom: "sum2"
  top: "conv10"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 0.1
  }
  convolution_param {
    num_output:64
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}






layer {
  name: "conv11"
  type: "Convolution"
  bottom: "conv10"
  top: "conv11"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 0.1
  }
  convolution_param {
    num_output: 1
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "output2"
  top: "conv1_2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 0.1
  }
  convolution_param {
    num_output: 1
    kernel_size: 7
    stride: 1
    pad: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
	name: "sum3"
	type: "Eltwise"
	bottom: "conv1_2"
	bottom: "conv11"
	top: "sum3"
	eltwise_param {
	  operation: 1
	}
}

layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "sum3"
  bottom: "label"
  top: "loss"
}
layer {
	name: "hdf5output"
   type: "HDF5Output"
   bottom: "data"   # 
   bottom: "sum3"   # 
   hdf5_output_param {
     file_name: "./VST_Net_bigmodify2_10_11_10.h5"
   }
  include { phase: TEST }
 }